Repository: KraftLauncher/kraft-launcher
Catalog: l10n/app_*.arb
Languages: ar, de, zh

source: Settings
ar: الإعدادات
de: Einstellungen
zh: 设置

source: Home
ar: الرئيسية
de: Startseite
zh: 首页

source: Profiles
ar: الملفات الشخصية
de: Profile
zh: 配置文件

source: Accounts
ar: الحسابات
de: Konten
zh: 账户

source: About
ar: حول
de: Über
zh: 关于

source: Switch Account
ar: تبديل الحساب
de: Konto wechseln
zh: 切换账户

source: Play
ar: تشغيل
de: Spielen
zh: 开始游戏

source: Add Account
ar: إضافة حساب
de: Konto hinzufügen
zh: 添加账户

source: Cancel
ar: إلغاء
de: Abbrechen
zh: 取消

source: Microsoft
ar: مايكروسوفت

source: Offline
ar: بدون اتصال
zh: 离线

source: Sign in with Microsoft
ar: تسجيل الدخول باستخدام مايكروسوفت
de: Mit Microsoft anmelden
zh: 使用 Microsoft 登录

source: Add Microsoft Account
ar: إضافة حساب مايكروسوفت
de: Microsoft-Konto hinzufügen
zh: 添加 Microsoft 账户

source: Copy Code
ar: نسخ الرمز
de: Code kopieren
zh: 复制代码

source: Copied to clipboard
ar: تم النسخ إلى الحافظة
de: In die Zwischenablage kopiert
zh: 已复制到剪贴板

# deviceCodeStepVisit
source: 1. Visit
ar: 1. قم بزيارة
de: 1. Besuche
zh: 1. 访问

# deviceCodeStepEnter
source: 2. Enter the code below:
ar: 2. أدخل الرمز أدناه:
de: 2. Gib den folgenden Code ein:
zh: 2. 输入以下代码：

# deviceCodeQrInstruction
source: Scan to open the link on another device. You’ll still need to enter the code above.
ar: امسح لفتح الرابط على جهاز آخر. ستحتاج إلى إدخال الرمز أعلاه أيضاً.
de: Scanne, um den Link auf einem anderen Gerät zu öffnen. Du musst auch den obigen Code eingeben.
zh: 扫描以在其他设备上打开链接。 你仍然需要输入上面的代码。

source: Logging in with Microsoft account
ar: جاري تسجيل الدخول بحساب مايكروسوفت
de: Anmeldung mit Microsoft-Konto
zh: 正在使用 Microsoft 账户登录

# authProgressWaitingForUserLogin
source: Waiting for user authentication...
ar: بانتظار مصادقة المستخدم...
de: Warte auf Benutzerauthentifizierung...
zh: 正在等待用户验证...

# authProgressExchangingAuthCode
source: Exchanging authorization code...
ar: جارٍ استبدال رمز التفويض...
de: Austausch des Autorisierungscodes...
zh: 正在交换授权码...

# authProgressRequestingXboxLiveToken
source: Requesting Xbox Live access...
ar: طلب الوصول إلى Xbox Live...
de: Zugriff auf Xbox Live anfordern...
zh: 正在请求 Xbox Live 访问权限...

# authProgressRequestingXstsToken
source: Authorizing Xbox Live session...
ar: تفويض جلسة Xbox Live...
de: Xbox Live-Sitzung autorisieren...
zh: 正在授权 Xbox Live 会话...

# authProgressLoggingIntoMinecraft
source: Logging into Minecraft services...
ar: تسجيل الدخول إلى خدمات Minecraft...
de: Anmeldung bei Minecraft-Diensten...
zh: 正在登录 Minecraft 服务...

# authProgressFetchingMinecraftProfile
source: Retrieving Minecraft profile...
ar: جلب ملف Minecraft الشخصي...
de: Minecraft-Profil abrufen...
zh: 正在获取 Minecraft 个人资料...

# loginSuccessAccountAddedMessage
source: Welcome, {username}! You’re now signed in to Minecraft.
ar: مرحباً، {username}! لقد سجلت الدخول إلى Minecraft بنجاح.
de: Hallo, {username}! Du hast dich erfolgreich bei Minecraft angemeldet.
zh: 欢迎，{username}！你已成功登录 Minecraft。

# loginSuccessAccountUpdatedMessage
source: Welcome back, {username}! Your account details have been updated.
ar: مرحباً مجدداً، {username}! تم تحديث تفاصيل حسابك.
de: Willkommen zurück, {username}! Deine Kontodaten wurden aktualisiert.
zh: 欢迎回来，{username}！你的账户信息已更新。

source: Username
ar: اسم المستخدم
de: Benutzername
zh: 用户名

source: Account Type
ar: نوع الحساب
de: Kontotyp
zh: 账户类型

source: Remove Account
ar: إزالة الحساب
de: Konto entfernen
zh: 移除账户

# unexpectedError
source: Unexpected error: {message}.
ar: خطأ غير متوقع: {message}.
de: Unerwarteter Fehler: {message}.
zh: 意外错误：{message}。

# missingAuthCodeError
source: Auth code not provided. Sign-in must be restarted.
ar: لم يتم توفير رمز التفويض. يجب إعادة بدء تسجيل الدخول.
de: Es wurde kein Autorisierungscode angegeben. Die Anmeldung muss neu gestartet werden.
zh: 未提供授权码。请重新开始登录。

# expiredAuthCodeError
source: Auth code has expired. Please restart sign-in process.
ar: انتهت صلاحية رمز التفويض. يرجى إعادة بدء عملية تسجيل الدخول.
de: Der Autorisierungscode ist abgelaufen. Bitte starte den Anmeldevorgang neu.
zh: 授权码已过期。请重新开始登录流程。

# expiredMicrosoftAccessTokenError
source: Microsoft OAuth access token expired. New sign-in required.
ar: انتهت صلاحية رمز وصول OAuth لمايكروسوفت. يجب تسجيل الدخول من جديد.
de: Das OAuth-Zugriffstoken für Microsoft ist abgelaufen. Bitte melde dich erneut an.
zh: Microsoft OAuth 访问令牌已过期。需要重新登录。

# unauthorizedMinecraftAccessError
source: Unauthorized access to Minecraft. Authorization is expired or invalid.
ar: وصول غير مصرح به إلى Minecraft. انتهت صلاحية التفويض أو أنه غير صالح.
de: Nicht autorisierter Zugriff auf Minecraft. Autorisierung ist abgelaufen oder ungültig.
zh: 未授权访问 Minecraft。授权已过期或无效。

source: Create Offline Account
ar: إنشاء حساب بدون اتصال
de: Offline-Konto erstellen
zh: 创建离线账户

source: Update Offline Account
ar: تحديث حساب بدون اتصال
de: Offline-Konto aktualisieren
zh: 更新离线账户

# offlineMinecraftAccountCreationNotice
source: Enter your desired Minecraft username. Offline accounts are stored locally and can't access online servers or Realms.
ar: أدخل اسم مستخدم Minecraft الذي ترغب به. يتم تخزين الحسابات غير المتصلة محليًا ولا يمكنها الوصول إلى الخوادم أو العوالم عبر الإنترنت.
de: Gib einen gewünschten Minecraft-Benutzernamen ein. Offline-Konten werden lokal gespeichert und können keine Online-Server oder Realms nutzen.
zh: 请输入你想要的 Minecraft 用户名。离线账户将被保存在本地，无法访问在线服务器或 Realms。

source: Create
ar: إنشاء
de: Erstellen
zh: 创建

# minecraftUsernameHint
source: e.g., Steve
ar: مثال: Steve
de: Beispiel: Steve
zh: 例如：Steve

# usernameEmptyError
source: Username cannot be empty
ar: لا يمكن أن يكون اسم المستخدم فارغًا
de: Benutzername darf nicht leer sein
zh: 用户名不能为空

# usernameTooShortError
source: Username must be at least 3 characters
ar: يجب أن يحتوي اسم المستخدم على 3 أحرف على الأقل
de: Benutzername muss mindestens 3 Zeichen lang sein
zh: 用户名至少需要 3 个字符

# usernameTooLongError
source: Username must be at most 16 characters
ar: يجب ألا يتجاوز اسم المستخدم 16 حرفًا
de: Benutzername darf maximal 16 Zeichen lang sein
zh: 用户名最多只能包含 16 个字符

# usernameInvalidCharactersError
source: Username can only contain letters, numbers, and underscores.
ar: يمكن أن يحتوي اسم المستخدم على أحرف وأرقام وعلامات underscore (_) فقط.
de: Benutzername darf nur Buchstaben, Zahlen und Unterstriche (_) enthalten.
zh: 用户名只能包含字母、数字和下划线。

# usernameContainsWhitespacesError
source: Username cannot contain spaces.
ar: لا يمكن أن يحتوي اسم المستخدم على مسافات.
de: Benutzername darf keine Leerzeichen enthalten.
zh: 用户名不能包含空格。

source: Update
ar: تحديث
de: Aktualisieren
zh: 更新

source: Minecraft ID
ar: معرّف Minecraft

# removeAccountConfirmation
source: Remove Account?
ar: هل تريد إزالة الحساب؟
de: Konto wirklich entfernen?
zh: 确认移除账户？

# removeAccountConfirmationNotice
source: This account will be removed from the launcher. You'll need to add it again to use it for playing.
ar: سيتم إزالة هذا الحساب من المشغل. ستحتاج إلى إضافته مرة أخرى لاستخدامه في اللعب.
de: Dieses Konto wird aus dem Launcher entfernt. Du musst es erneut hinzufügen, um damit zu spielen.
zh: 该账户将从启动器中移除。 你需要重新添加才能使用该账户进行游戏。

source: Remove
ar: إزالة
de: Entfernen
zh: 移除

source: Choose your preferred language
ar: اختر لغتك المفضلة
de: Wähle deine bevorzugte Sprache
zh: 选择你偏好的语言

source: App Language
ar: لغة التطبيق
de: App-Sprache
zh: 应用语言

source: System
ar: النظام
zh: 系统

source: Theme Mode
ar: وضع المظهر
de: Designmodus
zh: 主题模式

source: Select dark, light, or system theme
ar: اختر بين الوضع الداكن أو الفاتح أو نظام الجهاز
de: Wähle zwischen dunklem, hellem oder systemeigenem Design
zh: 选择深色、浅色或系统主题

source: Classic Material Design
ar: تصميم Material الكلاسيكي
de: Klassisches Material Design
zh: 经典 Material Design

# useClassicMaterialDesignTheme
source: Use the classic Material Design theme
ar: استخدم تصميم Material الكلاسيكي
de: Klassisches Material Design verwenden
zh: 使用经典 Material Design 主题

source: Dynamic Color
ar: ألوان ديناميكية
de: Dynamische Farben
zh: 动态配色

# automaticallyAdaptToSystemColors
source: Automatically adapt to the system colors
ar: التكيّف التلقائي مع ألوان النظام
de: Automatisch an Systemfarben anpassen
zh: 自动适应系统配色

source: General
ar: عام
de: Allgemein
zh: 通用

source: Java
ar: جافا

source: Launcher
ar: المشغل
zh: 启动器

source: Advanced
ar: متقدم
de: Erweitert
zh: 高级

source: Appearance
ar: المظهر
de: Darstellung
zh: 外观

source: Dark
ar: داكن
de: Dunkel
zh: 深色

source: Light
ar: فاتح
de: Hell
zh: 浅色

source: Custom Accent Color
ar: لون التمييز المخصص
de: Benutzerdefinierte Akzentfarbe
zh: 自定义强调色

# customizeAccentColor
source: Customize the accent color of the app theme.
ar: قم بتخصيص لون التمييز لمظهر التطبيق.
de: Passen Sie die Akzentfarbe des App-Themes an.
zh: 自定义应用主题的强调色。

source: Pick a Color
ar: اختر لونًا
de: Farbe auswählen
zh: 选择颜色

source: Close
ar: إغلاق
de: Schließen
zh: 关闭

# authProgressExchangingDeviceCode
source: Exchanging device code...
ar: جاري تبادل رمز الجهاز...
de: Gerätecode wird ausgetauscht...
zh: 正在交换设备代码...

# authProgressRequestingDeviceCode
source: Exchanging device code...
ar: جاري طلب رمز الجهاز...
de: Gerätecode wird angefordert...
zh: 正在请求设备代码...

source: OR
ar: أو
de: ODER
zh: 或

source: Try Again
ar: حاول مرة أخرى
de: Erneut versuchen
zh: 请再试一次

source: UI Preferences
ar: تفضيلات الواجهة
de: UI-Einstellungen
zh: 界面偏好设置

source: Default Tab
ar: علامة التبويب الافتراضية
de: Standard-Tab
zh: 默认标签页

# initialTabSelectionDescription
source: Choose the tab shown first when the app opens
ar: اختر علامة التبويب التي تظهر أولاً عند فتح التطبيق
de: Wählen Sie den Tab, der beim Start der App zuerst angezeigt wird
zh: 选择应用启动时首先显示的标签页

source: Search
ar: بحث
de: Suche
zh: 搜索

source: Refresh Account
ar: تحديث الحساب
de: Konto aktualisieren
zh: 刷新账户

# sessionExpiredOrAccessRevoked
source: The account session has expired or access was revoked. Please log in again to continue.
ar: انتهت جلسة الحساب أو تم إلغاء الوصول. يرجى تسجيل الدخول مرة أخرى للاستمرار.
de: Die Sitzung des Kontos ist abgelaufen oder der Zugriff wurde widerrufen. Bitte melde dich erneut an, um fortzufahren.
zh: 账户会话已过期或访问权限已被撤销。请重新登录以继续。

# accountRefreshedMessage
source: Account for {username} has been refreshed successfully.
ar: تم تحديث الحساب لـ {username} بنجاح.
de: Das Konto für {username} wurde erfolgreich aktualisiert.
zh: {username} 的账户已成功刷新。

source: Revoke Access
ar: إلغاء الوصول
de: Zugriff widerrufen
zh: 撤销访问

# microsoftRequestLimitError
source: Request limit reached while communicating with Microsoft authentication servers. Please try again shortly.
ar: تم الوصول إلى حد الطلبات أثناء الاتصال بخوادم مصادقة Microsoft. يرجى المحاولة مرة أخرى بعد قليل.
de: Anforderungsgrenze erreicht beim Kommunizieren mit den Microsoft-Authentifizierungsservern. Bitte versuche es in Kürze erneut.
zh: 与 Microsoft 认证服务器通信时达到请求限制。请稍后再试。

# authProgressRefreshingMicrosoftTokens
source: Refreshing Microsoft tokens...
ar: جارٍ تحديث رموز Microsoft...
de: Microsoft-Tokens werden aktualisiert...
zh: 正在刷新 Microsoft 令牌...

# authProgressCheckingMinecraftJavaOwnership
source: Checking Minecraft Java ownership...
ar: جارٍ التحقق من ملكية Minecraft Java...
de: Überprüfe Minecraft Java-Besitz...
zh: 正在检查 Minecraft Java 所有权...

# waitForOngoingTask
source: Please hold on while the current task finishes.
ar: يرجى الانتظار حتى ينتهي المهمة الحالية.
de: Bitte warte, während die aktuelle Aufgabe abgeschlossen wird.
zh: 请稍等，当前任务正在完成。

# accountsEmptyTitle
source: Manage Minecraft Accounts
ar: إدارة حسابات Minecraft
de: Minecraft-Konten verwalten
zh: 管理 Minecraft 账户

# accountsEmptySubtitle
source: Add Minecraft accounts for seamless switching. Accounts are stored securely on this device.
ar: أضف حسابات Minecraft للتبديل السلس. يتم تخزين الحسابات بأمان على هذا الجهاز.
de: Füge Minecraft-Konten hinzu, um nahtlos zu wechseln. Konten werden sicher auf diesem Gerät gespeichert.
zh: 添加 Minecraft 账户以实现无缝切换。账户安全存储在此设备上。

# authCodeRedirectPageLoginSuccessTitle
source: Successful Login
ar: تم تسجيل الدخول
de: Erfolgreiche Anmeldung
zh: 登录成功

# authCodeRedirectPageLoginSuccessMessage
source: You have successfully logged in to {launcherName} using your Microsoft account. You can close this window.
ar: لقد قمت بتسجيل الدخول بنجاح إلى {launcherName} باستخدام حساب Microsoft الخاص بك. يمكنك الآن إغلاق هذه النافذة.
de: Du hast dich erfolgreich bei {launcherName} mit deinem Microsoft-Konto angemeldet. Du kannst dieses Fenster nun schließen.
zh: 您已成功使用 Microsoft 账户登录到 {launcherName}。您现在可以关闭此窗口。

# errorOccurred
source: An Error Occurred
ar: حدث خطأ
de: Ein Fehler ist aufgetreten
zh: 发生了一个错误

source: Report Bug
ar: الإبلاغ عن خطأ
de: Fehler melden
zh: 报告错误

# unknownErrorWhileLoadingAccounts
source: An unknown error occurred while loading the accounts. Please try again later.
ar: حدث خطأ غير معروف أثناء تحميل الحسابات. يرجى المحاولة لاحقًا.
de: Ein unbekannter Fehler ist beim Laden der Konten aufgetreten. Bitte versuchen Sie es später erneut.
zh: 加载账户时发生了未知错误。请稍后再试。

# minecraftRequestLimitError
source: Request limit reached while communicating with Minecraft servers. Please try again shortly.
ar: تم الوصول إلى حد الطلب أثناء التواصل مع خوادم ماينكرافت. يرجى المحاولة لاحقًا.
de: Anfrage-Limit erreicht beim Kommunizieren mit den Minecraft-Servern. Bitte versuchen Sie es in Kürze erneut.
zh: 与Minecraft服务器通信时达到请求限制。请稍后再试。

# unexpectedMinecraftApiError
source: Unexpected error while communicating with Minecraft servers: {message}. Please try again later.
ar: حدث خطأ غير متوقع أثناء التواصل مع خوادم ماينكرافت: {message}. يرجى المحاولة لاحقًا.
de: Unerwarteter Fehler bei der Kommunikation mit den Minecraft-Servern: {message}. Bitte versuchen Sie es später erneut.
zh: 与Minecraft服务器通信时发生意外错误：{message}。请稍后再试。

# unexpectedMicrosoftApiError
source: Unexpected error while communicating with Microsoft servers: {message}. Please try again later.
ar: حدث خطأ غير متوقع أثناء التواصل مع خوادم مايكروسوفت: {message}. يرجى المحاولة لاحقًا.
de: Unerwarteter Fehler bei der Kommunikation mit den Microsoft-Servern: {message}. Bitte versuchen Sie es später erneut.
zh: 与Microsoft服务器通信时发生意外错误：{message}。请稍后再试。

# errorLoadingNetworkImage
source: An error occurred while loading the image: {message}
ar: حدث خطأ أثناء تحميل الصورة: {message}
de: Fehler beim Laden des Bildes: {message}
zh: 加载图像时发生错误：{message}

# skinModelClassic
source: Classic
ar: كلاسيكي
de: Klassisch
zh: 经典

# skinModelSlim
source: Slim
ar: نحيف
zh: 瘦身

source: Skin Model
ar: نموذج الجلد
de: Skin-Modell
zh: 皮肤模型

source: Update Skin
ar: تحديث الجلد
de: Skin aktualisieren
zh: 更新皮肤

# featureUnsupportedYet
source: This feature is not supported yet. Stay tuned for future updates!
ar: هذه الميزة غير مدعومة بعد. تابع التحديثات المستقبلية!
de: Diese Funktion wird noch nicht unterstützt. Bleiben Sie dran für zukünftige Updates!
zh: 此功能尚不支持。请关注未来的更新！

source: News
ar: أخبار
de: Nachrichten
zh: 新闻

# legalDisclaimerMessage
source: {launcherName} is NOT AN OFFICIAL MINECRAFT PRODUCT. It is NOT APPROVED BY OR ASSOCIATED WITH MOJANG OR MICROSOFT.
ar: {launcherName} ليس منتج Minecraft رسمي. لم يتم اعتماده أو ربطه مع Mojang أو Microsoft.
de: {launcherName} ist KEIN OFFIZIELLES MINECRAFT-PRODUKT. Es ist NICHT VON MOJANG ODER MICROSOFT GENEHMIGT ODER MIT IHNEN VERBUNDEN.
zh: {launcherName} 不是官方的Minecraft产品。未获得Mojang或Microsoft的批准或与其关联。

source: Support
ar: الدعم
zh: 支持

source: Website
ar: الموقع الإلكتروني
zh: 网站

source: Contact
ar: اتصل
de: Kontakt
zh: 联系方式

# askQuestion
source: Ask a question
ar: اطرح سؤالاً
de: Frage stellen
zh: 提问

source: License
ar: رخصة
de: Lizenz
zh: 许可证

# loginDeviceCodeExpired
source: The login code has expired. Please try again.
de: Der Login-Code ist abgelaufen. Bitte versuche es erneut.
zh: 登录代码已过期。请再试一次。

source: Source Code
zh: 源代码

# invalidMinecraftSkinFile
source: Invalid skin image. Please upload a valid Minecraft skin file.
de: Ungültiges Hautbild. Bitte laden Sie eine gültige Minecraft-Skin-Datei hoch.
zh: 无效的皮肤图像。请上传有效的Minecraft皮肤文件。
